spec/fixtures/total_express_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://edi.totalexpress.com.br/soap/webservice_v24.total" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:ObterTracking><ObterTrackingRequest><DataConsulta>2020-08-10</DataConsulta></ObterTrackingRequest></tns:ObterTracking></env:Body></env:Envelope>
